package com.dy.qxjhutil.base;

/**
 * Created by Dy on 2019/4/17 23
 *
 * @author Dy
 */
public class WxInfoModel {
    public static String[] stringList = {
            "两小无猜", "青梅竹马",
            "凶神恶煞", "金国小王爷", "飞天蝙蝠", "狮王", "燕子坞主", "大轮明王", "灭绝道姑", "灵鹫宫主", "明教教主", "南苑大王", "丐帮帮主", "白陀山主", "少林三僧",
            "不可不戒", "长春首徒", "邵敏郡主", "无恶不作", "小东邪", "君子剑", "龙姑娘", "林家公子", "金刀驸马", "蓉儿", "神雕大侠", "九剑传人", "剑圣",
            "玉面孟尝", "婉儿", "穷凶极恶", "余观主", "蝠王", "鹰王", "阿紫", "铜尸", "铁尸", "金轮国师", "峨眉掌门", "东方姑娘", "聪辩先生",
            "白驼山少主", "灵儿", "波斯圣女", "恶贯满盈", "玄冥二老", "神仙姐姐", "魔教圣女", "龙王", "星宿老仙", "扫地僧", "大理世子", "魔教教主", "大理皇帝", "东海岛主", "武当掌门",
    };

    public static int[] trends = {
            0, 0,
            0, 0, -1, -1, 1, 1, -1, 0, 1, 1, 0, 1, 99,
            -1, -1, 0, 0, 0, -1, 0, -1, 1, 0, -1, 99, 99,
            0, 0, 0, 0, -1, 1, -1, 1, 1, 0, 0, -1, 99,
            99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99,
    };
    public static int[] goods = {
            0, 0,
            -1, -1, 1, 0, -1, -1, 0, 1, 1, 1, 1, -1, 99, 99,
            0, 1, 0, -1, 0, -1, 0, -1, 1, 0, 1, 99, 99,
            -1, 1, -1, -1, 0, 0, 0, -1, -1, 0, -1, 0, 99,
            99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99,
    };

    public static String[] parents = {
            "中立", "中立",
            "豪侠", "豪侠", "豪侠", "豪侠", "豪侠", "豪侠", "豪侠", "豪侠", "豪侠", "豪侠", "豪侠", "豪侠", "豪侠",
            "游侠", "游侠", "游侠", "游侠", "游侠", "游侠", "游侠", "游侠", "游侠", "游侠", "游侠", "游侠", "游侠",
            "刺客", "刺客", "刺客", "刺客", "刺客", "刺客", "刺客", "刺客", "刺客", "刺客", "刺客", "刺客", "刺客",
            "气宗", "气宗", "气宗", "气宗", "气宗", "气宗", "气宗", "气宗", "气宗", "气宗", "气宗", "气宗", "气宗", "气宗", "气宗",
    };


}
